
# tap repositories and their packages

tap 'homebrew/core'
brew 'ada-url'
brew 'ansible-language-server'
brew 'aom'
brew 'argocd'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'biome'
brew 'bottom'
brew 'brotli'
brew 'btop'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'ccusage'
brew 'certifi'
brew 'cmake'
brew 'colima'
brew 'dav1d'
brew 'deno'
brew 'diffnav'
brew 'difftastic'
brew 'docker'
brew 'docker-completion'
brew 'dotnet'
brew 'dotnet@9'
brew 'duti'
brew 'expat'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'flac'
brew 'fmt'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gdbm'
brew 'gemini-cli'
brew 'gettext'
brew 'ggml'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'gopls'
brew 'gpgme'
brew 'gpgmepp'
brew 'graphite2'
brew 'grep'
brew 'handbrake'
brew 'harfbuzz'
brew 'hdrhistogram_c'
brew 'helix'
brew 'helm'
brew 'htop'
brew 'icu4c@77'
brew 'icu4c@78'
brew 'imagemagick'
brew 'istioctl'
brew 'jansson'
brew 'jpeg-turbo'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'krb5'
brew 'krew'
brew 'kubernetes-cli'
brew 'kubie'
brew 'lame'
brew 'lazydocker'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libdatrie'
brew 'libde265'
brew 'libdvdcss'
brew 'libdvdnav'
brew 'libdvdread'
brew 'libevent'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'libmagic'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libogg'
brew 'libomp'
brew 'libplacebo'
brew 'libpng'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libssh2'
brew 'libtasn1'
brew 'libthai'
brew 'libtiff'
brew 'libtool'
brew 'libudfread'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'lima'
brew 'little-cms2'
brew 'llhttp'
brew 'llvm'
brew 'lua'
brew 'lua-language-server'
brew 'luajit'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mad'
brew 'make'
brew 'markdown-oxide'
brew 'marksman'
brew 'mas'
brew 'merve'
brew 'mise'
brew 'molten-vk'
brew 'mpdecimal'
brew 'mpg123'
brew 'mpv'
brew 'mujs'
brew 'nbytes'
brew 'ncurses'
brew 'nettle'
brew 'nmap'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'openclaw-cli'
brew 'openjpeg'
brew 'openssl@3'
brew 'opus'
brew 'opusfile'
brew 'p11-kit'
brew 'pango'
brew 'pcre2'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'poppler'
brew 'portaudio'
brew 'postgresql@18'
brew 'pug'
brew 'pyright'
brew 'readline'
brew 'resvg'
brew 'ripgrep'
brew 'rubberband'
brew 'ruff'
brew 'rust'
brew 'rustup'
brew 'scc'
brew 'screenresolution'
brew 'sdl2'
brew 'sevenzip'
brew 'shaderc'
brew 'shellcheck'
brew 'simdjson'
brew 'simdutf'
brew 'sox'
brew 'speedtest-cli'
brew 'speex'
brew 'sqlite'
brew 'stow'
brew 'stylua'
brew 'svt-av1'
brew 'taplo'
brew 'terraform-ls'
brew 'tesseract'
brew 'theora'
brew 'trash'
brew 'trash-cli'
brew 'tree'
brew 'tree-sitter'
brew 'uchardet'
brew 'unbound'
brew 'usage'
brew 'utf8proc'
brew 'uv'
brew 'uvwasi'
brew 'vapoursynth'
brew 'vscode-langservers-extracted'
brew 'vulkan-headers'
brew 'vulkan-loader'
brew 'webp'
brew 'wget'
brew 'whisper-cpp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xz'
brew 'yaml-language-server'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'z3'
brew 'zimg'
brew 'zoxide'
brew 'zstd'

tap 'homebrew/cask'
cask 'brave-browser'
cask 'claude-code@latest'
cask 'codex'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'firefox'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-symbols-only-nerd-font'
cask 'handbrake-app'
cask 'hiddenbar'
cask 'karabiner-elements'
cask 'kitlangton-hex'
cask 'linearmouse'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'ngrok'
cask 'obs'
cask 'obsidian'
cask 'spaceid'
cask 'spotify'
cask 'vlc'
cask 'wezterm'
cask 'zed'
cask 'zoom'

tap 'ankitpokhrel/jira-cli'

tap 'cost/tap'
cask 'disney-claude'

tap 'devproductivity/devx-cli'
brew 'devx-cli'

tap 'dlvhdr/formulae'

tap 'docker/tap'

tap 'f/mcptools'
brew 'mcp'

tap 'jesseduffield/lazydocker'

tap 'jnsahaj/lumen'

tap 'kreuzwerker/taps'
brew 'm1-terraform-provider-helper'

tap 'leg100/tap'

tap 'mhaeuser/mhaeuser'
cask 'battery-toolkit'

tap 'multica-ai/tap'

tap 'nikitabobko/tap'
cask 'aerospace'

tap 'raine/claude-history'
brew 'claude-history'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'GarageBand (10.4.13)', id: 682658836
mas 'iMovie (10.4.4)', id: 408981434
mas 'Keynote (14.5)', id: 409183694
mas 'Numbers (14.5)', id: 409203825
mas 'Pages (14.5)', id: 409201541
