
# tap repositories and their packages

tap 'homebrew/core'
brew 'ansible-language-server'
brew 'argocd'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'biome'
brew 'bottom'
brew 'btop'
brew 'ccusage'
brew 'claude-squad'
brew 'cmake'
brew 'colima'
brew 'diffnav'
brew 'difftastic'
brew 'docker'
brew 'docker-completion'
brew 'duti'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gemini-cli'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gnupg'
brew 'gopls'
brew 'grep'
brew 'handbrake'
brew 'helix'
brew 'helm'
brew 'htop'
brew 'imagemagick'
brew 'istioctl'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'krew'
brew 'kubernetes-cli'
brew 'kubie'
brew 'lazydocker'
brew 'lazygit'
brew 'libtool'
brew 'llvm'
brew 'lua-language-server'
brew 'make'
brew 'markdown-oxide'
brew 'marksman'
brew 'mas'
brew 'mergiraf'
brew 'merve'
brew 'mise'
brew 'mpv'
brew 'nmap'
brew 'pkgconf'
brew 'poppler'
brew 'postgresql@18'
brew 'pug'
brew 'pyright'
brew 'ripgrep'
brew 'ruff'
brew 'scc'
brew 'screenresolution'
brew 'sevenzip'
brew 'shellcheck'
brew 'sox'
brew 'speedtest-cli'
brew 'stow'
brew 'stylua'
brew 'taplo'
brew 'terraform-ls'
brew 'tesseract'
brew 'tmux'
brew 'trash'
brew 'trash-cli'
brew 'tree'
brew 'usage'
brew 'vscode-langservers-extracted'
brew 'wget'
brew 'whisper-cpp'
brew 'yaml-language-server'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'zoxide'

tap 'homebrew/cask'
cask 'brave-browser'
cask 'claude-code@latest'
cask 'codex'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'firefox'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-symbols-only-nerd-font'
cask 'handbrake-app'
cask 'hiddenbar'
cask 'karabiner-elements'
cask 'kitlangton-hex'
cask 'linearmouse'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'ngrok'
cask 'obs'
cask 'obsidian'
cask 'spaceid'
cask 'spotify'
cask 'vlc'
cask 'wezterm'
cask 'zed'
cask 'zoom'

tap 'dlvhdr/formulae'

tap 'docker/tap'

tap 'f/mcptools'
brew 'mcp'

tap 'hashicorp/tap'

tap 'jesseduffield/lazydocker'

tap 'jnsahaj/lumen'

tap 'kreuzwerker/taps'
brew 'm1-terraform-provider-helper'

tap 'leg100/tap'

tap 'mhaeuser/mhaeuser'
cask 'battery-toolkit'

tap 'multica-ai/tap'

tap 'nikitabobko/tap'
cask 'aerospace'

tap 'raine/claude-history'
brew 'claude-history'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'GarageBand (10.4.14)', id: 682658836
mas 'iMovie (10.4.4)', id: 408981434
mas 'Keynote (14.5)', id: 409183694
mas 'Numbers (14.5)', id: 409203825
mas 'Pages (14.5)', id: 409201541

main ./Brewfile.$HOSTNAME
